{
  "backend/main.mo": "Actor handling user profiles and customer inquiries with authorization checks and admin-only inquiry retrieval.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and tests associated with branding, marketing copy, SEO, and product content updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including layout, pages, hooks, content, and configuration.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables and dark mode tokens for background, text, and UI colors.",
  "frontend/index.html": "Basic HTML entry file setting the Makana Man page title and loading the React application.",
  "frontend/src/App.tsx": "Main React router configuration defining routes for all public pages and the admin inquiries page.",
  "frontend/src/components/auth/AdminGate.tsx": "Authorization wrapper that checks authentication and admin role before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/forms/ContactForm.tsx": "Customer contact form submitting inquiries with validation, success indicators, and error handling.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding, navigation links, contact info, and a copyright line.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout with header, routed content, and footer.",
  "frontend/src/components/nav/HeaderNav.tsx": "Implements a responsive header with logo, navigation links, and login button for desktop and mobile.",
  "frontend/src/content/packets.ts": "Exports a Packet interface and static packet data used for product listings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for creating, storing, and managing Internet Identity authentication.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, role, inquiries, and submitting data via the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines a custom color palette with light/dark theme variables and utilities.",
  "frontend/src/lib/seo.ts": "Hooks to set the page title and meta description dynamically.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company story, feature highlights, and mission section, setting the document title on mount.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "Admin-only page that loads, sorts, and displays customer inquiries with loading and error states handled.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form and company contact details, setting the page title and providing email, phone, and business hour info.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero section, feature highlights, and navigation buttons, setting the document title on load.",
  "frontend/src/pages/PacketsPage.tsx": "Lists available snack packets using card components and provides navigation to contact for inquiries or custom orders.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, supporting hash and query-string routing.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, fonts, container settings, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Project state file defining versioning, website goals, existing features, and requirements for building the Makana Man marketing site and backend inquiry handling."
}